"""
Напишите программу, которая считает площадь прямоугольника,
спрашивая у пользователя длину двух сторон
"""
a = int(input('Введите длину прямоугольника: '))
b = int(input('Введите ширину прямоугольника: '))
print(f'Площадь прямоугольника со сторонами {a} и {b} равна {a * b}')
