"""
Принципы ООП
- Наследование
- Инкапсуляция
- Полиморфизм
- Абстракция (?)

Наследование
Наследование позволяет переиспользовать тот код,
который у вас уже есть, что делает разработку быстрее

Инкапсуляция
Инкапсуляция позволяет скрывать реализацию методов,
что делает их использование намного удобнее

Полиморфизм
Позволяет использовать функции по разному, вне
зависимости от типа их параметров

Абстракция
Абстракция позволяет упрощать сложные задачи,
создавая небольшие классы для решения простых.
"""