"""
task_2.3 - Создать tuple из 10

Создать tuple из 10 любых дробных чисел, найти
максимальное и минимальное значение в нем.
"""
a = (1.12, 3.25, 6.78, 4.64, 7.02, 5.24, 4.12, 3.62, 8.15, 2.24)
print(f'максимально значение {max(a)}, минимальное {min(a)}')

